// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
//4 -> да
//-3 -> нет
//7 -> нет

int num=4;
if (num%2 == 0)
    {Console.WriteLine(num +" - Четное число");}
else
    {Console.WriteLine(num +" - Нечетное число");}
